arr=['Агрыз','Алушта','Анапа','Бавлы','Барнаул','Белгород','Валдай','Великий Новгород','Владикавказ','Гагарин','Горно-Алтайск','Грозный','Донецк','Домодедово','Дубна',
     'Евпатория','Екатеринбург','Елабуга','Железногорск','Жуков','Жуковский','Заинск','Заречный','Звенигород','Иваново','Ижевск','Иннополис','Йошкар-Ола','Казань',
     'Калининград','Калуга','Лениногорск','Ленск','Липецк','Майкоп','Махачкала','Москва','Нальчик','Нарьян-Мар','Нижний Новгород','Обь','Одинцово','Омск','Пенза','Пермь',
     'Радужный','Ростов-на-Дону','Рязань','Салехард','Самара','Санкт-Петербург','Тамбов','Тверь','Томск','Улан-Удэ','Ульяновск','Уфа','Феодосия',
     'Фокино','Фурманов','Хабаровск','Ханты-Мансийск','Цивильск','Цимлянск','Чебоксары','Челябинск','Чита','Шахты','Шилка','Щёкино','Щёлково','Элиста','Энгельс',
     'Южно-Сахалинск','Юрга','Якутск','Ярославль']
arr_leght=len(arr)
found=int(input("Введите кол-во букв: "))
a=[]
for i in range (0,arr_leght):
    if len(arr[i])<=found:
        a.append(arr[i])
print(a)